src/cf/DocumentJournals/ЭлектроннаяПочта.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.17">
	<DocumentJournal>
		<Properties>
			<Name>ЭлектроннаяПочта</Name>
			<RegisteredDocuments>
				<xr:Item>Document.ВходящееПисьмо</xr:Item>
				<xr:Item>Document.ИсходящееПисьмо</xr:Item>
			</RegisteredDocuments>
		</Properties>
		<ChildObjects>
			<Column>
				<Properties>
					<Name>Адресаты</Name>
					<References>
						<xr:Item>Document.ИсходящееПисьмо.Attribute.ПолучателиПисьмаСтрокой</xr:Item>
					</References>
				</Properties>
			</Column>
			<Column>
				<Properties>
					<Name>Важность</Name>
					<References>
						<xr:Item>Document.ВходящееПисьмо.Attribute.Важность</xr:Item>
						<xr:Item>Document.ИсходящееПисьмо.Attribute.Важность</xr:Item>
					</References>
				</Properties>
			</Column>
			<Column>
				<Properties>
					<Name>ВидМаршрутизации</Name>
					<References>
						<xr:Item>Document.ВходящееПисьмо.Attribute.ВидМаршрутизации</xr:Item>
						<xr:Item>Document.ИсходящееПисьмо.Attribute.ВидМаршрутизации</xr:Item>
					</References>
				</Properties>
			</Column>
			<Column>
				<Properties>
					<Name>ДатаОтправкиПолучения</Name>
					<References>
						<xr:Item>Document.ВходящееПисьмо.Attribute.ДатаПолучения</xr:Item>
						<xr:Item>Document.ИсходящееПисьмо.Attribute.ДатаОтправки</xr:Item>
					</References>
				</Properties>
			</Column>
			<Column>
				<Properties>
					<Name>ЕстьВложения</Name>
					<References>
						<xr:Item>Document.ВходящееПисьмо.Attribute.ЕстьВложения</xr:Item>
						<xr:Item>Document.ИсходящееПисьмо.Attribute.ЕстьВложения</xr:Item>
					</References>
				</Properties>
			</Column>
			<Column>
				<Properties>
					<Name>Комментарий</Name>
					<References>
						<xr:Item>Document.ВходящееПисьмо.Attribute.Комментарий</xr:Item>
						<xr:Item>Document.ИсходящееПисьмо.Attribute.Комментарий</xr:Item>
					</References>
				</Properties>
			</Column>
			<Column>
				<Properties>
					<Name>НомерСпособаАдресации</Name>
					<References>
						<xr:Item>Document.ВходящееПисьмо.Attribute.НомерСпособаАдресации</xr:Item>
						<xr:Item>Document.ИсходящееПисьмо.Attribute.НомерСпособаАдресации</xr:Item>
					</References>
				</Properties>
			</Column>
			<Column>
				<Properties>
					<Name>Отправитель</Name>
					<References>
						<xr:Item>Document.ИсходящееПисьмо.Attribute.ОтправительКонтакт</xr:Item>
						<xr:Item>Document.ВходящееПисьмо.Attribute.ОтправительАдресат</xr:Item>
					</References>
				</Properties>
			</Column>
			<Column>
				<Properties>
					<Name>ОтправкаОтменена</Name>
					<References>
						<xr:Item>Document.ИсходящееПисьмо.Attribute.ОтправкаОтменена</xr:Item>
					</References>
				</Properties>
			</Column>
			<Column>
				<Properties>
					<Name>Отправлено</Name>
					<References>
						<xr:Item>Document.ИсходящееПисьмо.Attribute.ДатаОтправки</xr:Item>
						<xr:Item>Document.ВходящееПисьмо.Attribute.ДатаОтправки</xr:Item>
					</References>
				</Properties>
			</Column>
			<Column>
				<Properties>
					<Name>Папка</Name>
					<References>
						<xr:Item>Document.ВходящееПисьмо.Attribute.Папка</xr:Item>
						<xr:Item>Document.ИсходящееПисьмо.Attribute.Папка</xr:Item>
					</References>
				</Properties>
			</Column>
			<Column>
				<Properties>
					<Name>Получатели</Name>
					<References>
						<xr:Item>Document.ИсходящееПисьмо.Attribute.ПолучателиПисьмаСтрокой</xr:Item>
					</References>
				</Properties>
			</Column>
			<Column>
				<Properties>
					<Name>Получено</Name>
					<References>
						<xr:Item>Document.ВходящееПисьмо.Attribute.ДатаПолучения</xr:Item>
					</References>
				</Properties>
			</Column>
			<Column>
				<Properties>
					<Name>Предмет</Name>
					<References>
						<xr:Item>Document.ВходящееПисьмо.Attribute.Предмет</xr:Item>
						<xr:Item>Document.ИсходящееПисьмо.Attribute.Предмет</xr:Item>
					</References>
				</Properties>
			</Column>
			<Column>
				<Properties>
					<Name>Размер</Name>
					<References>
						<xr:Item>Document.ВходящееПисьмо.Attribute.Размер</xr:Item>
						<xr:Item>Document.ИсходящееПисьмо.Attribute.Размер</xr:Item>
					</References>
				</Properties>
			</Column>
			<Column>
				<Properties>
					<Name>Тема</Name>
					<References>
						<xr:Item>Document.ВходящееПисьмо.Attribute.Тема</xr:Item>
						<xr:Item>Document.ИсходящееПисьмо.Attribute.Тема</xr:Item>
					</References>
				</Properties>
			</Column>
			<Column>
				<Properties>
					<Name>УчетнаяЗапись</Name>
					<References>
						<xr:Item>Document.ВходящееПисьмо.Attribute.УчетнаяЗапись</xr:Item>
						<xr:Item>Document.ИсходящееПисьмо.Attribute.УчетнаяЗапись</xr:Item>
					</References>
				</Properties>
			</Column>
		</ChildObjects>
	</DocumentJournal>
</MetaDataObject>

src/cf/InformationRegisters/НастройкиАвтоочисткиПапокПисем.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.19">
	<InformationRegister>
		<Properties>
			<Name>НастройкиАвтоочисткиПапокПисем</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>ПериодУстаревания</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Папка</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ПапкиПисем</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

src/cf/Enums/ВариантыОтображенияОбластиЧтения.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.19">
	<Enum>
		<Properties>
			<Name>ВариантыОтображенияОбластиЧтения</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>Справа</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Внизу</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>НеОтображать</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

src/cf/DocumentJournals/ЭлектроннаяПочта/Ext/ManagerModule.bsl
Процедура ОбработкаПолученияФормы(ВидФормы, Параметры, ВыбраннаяФорма, ДополнительнаяИнформация, СтандартнаяОбработка)
	
	Если ВидФормы = "ФормаСписка" Тогда
		
		ОтображениеОбластиЧтения =
			ВстроеннаяПочтаСервер.ПолучитьПерсональнуюНастройку("ОтображениеОбластиЧтения");
			
		Если Не ЗначениеЗаполнено(ОтображениеОбластиЧтения) Тогда
			ОтображениеОбластиЧтения = Перечисления.ВариантыОтображенияОбластиЧтения.НеОтображать;
		КонецЕсли;
		
		ВидСписка = ВстроеннаяПочтаСервер.ПолучитьПерсональнуюНастройку("ВидСписка");
		ПоказыватьДеревоПапок = (ВидСписка = "Обычный");
		ОбластьСправа = Перечисления.ВариантыОтображенияОбластиЧтения.Справа;
		
		ДвустрочныйРежим = (ОтображениеОбластиЧтения = ОбластьСправа);
		
		Если ДвустрочныйРежим Тогда
			ВыбраннаяФорма = "ФормаСпискаДвустрочная";
			СтандартнаяОбработка = Ложь;
		КонецЕсли;
		
	КонецЕсли;
	
КонецПроцедуры


// Удаляет порцию устаревших данных.
// 
// Возвращаемое значение - Булево - Истина, если были найдены устаревшие данные, в противном случае Ложь.
// 
Функция УдалитьПорциюУстаревшихДанных() Экспорт
	
	БылиПисьмаДляУдаления = Ложь;
	
	УстановитьПривилегированныйРежим(Истина);
	
	ЗаписьЖурналаРегистрации(
		НСтр("ru = 'Очистка папок от старых писем'", ОбщегоНазначенияКлиентСервер.КодОсновногоЯзыка()),
		УровеньЖурналаРегистрации.Информация,,,
		НСтр("ru = 'Начало выполнения'", ОбщегоНазначенияКлиентСервер.КодОсновногоЯзыка()));
	
	Настройки = РегистрыСведений.НастройкиАвтоочисткиПапокПисем.Выбрать();
	Пока Настройки.Следующий() Цикл
		Запрос = Новый Запрос;
		
		Запрос.Текст = 
			"ВЫБРАТЬ ПЕРВЫЕ 1000
			|	ЭлектроннаяПочта.Ссылка КАК Письмо
			|ИЗ
			|	ЖурналДокументов.ЭлектроннаяПочта КАК ЭлектроннаяПочта
			|ГДЕ
			|	ЭлектроннаяПочта.ПометкаУдаления = ЛОЖЬ
			|	И ЭлектроннаяПочта.Папка = &Папка
			|	И ЭлектроннаяПочта.Дата < &ДатаУстаревания
			|
			|УПОРЯДОЧИТЬ ПО
			|	ЭлектроннаяПочта.Дата";
		Запрос.УстановитьПараметр("Папка", Настройки.Папка);
		ДатаУстаревания = ТекущаяДата() - Настройки.ПериодУстаревания * 24 * 60 * 60;
		Запрос.УстановитьПараметр("ДатаУстаревания", ДатаУстаревания);
		Выборка = Запрос.Выполнить().Выбрать();
		
		Пока Выборка.Следующий() Цикл
			
			ЕстьЗанятыеФайлы = Ложь;
			
			ФайлыПисьма = ВстроеннаяПочтаСервер.ПолучитьФайлыПисьма(
				Выборка.Письмо, // Письмо
				Истина, // ФормироватьРазмерПредставление
				Ложь, // ВключатьПомеченныеНаУдаление
				Ложь,    // ТолькоСИдентификаторами
				Ложь); // ТолькоБезИдентификаторов  - чтобы картинки в HTML не показывать
				
			Для каждого ФайлПисьма Из ФайлыПисьма Цикл	
				
				Если ЗначениеЗаполнено(ФайлПисьма.Редактирует) Тогда
					ЕстьЗанятыеФайлы = Истина;
					Прервать;
				КонецЕсли;	
				
			КонецЦикла;	            
			
			Если ЕстьЗанятыеФайлы Тогда
				Продолжить;
			КонецЕсли;	
			
			БылиПисьмаДляУдаления = Истина;      
			
			Попытка
				
				ЗаблокироватьДанныеДляРедактирования(Выборка.Письмо);
				ПисьмоОбъект = Выборка.Письмо.ПолучитьОбъект();
				ПисьмоОбъект.УстановитьПометкуУдаления(Истина);
				РазблокироватьДанныеДляРедактирования(Выборка.Письмо);
				
			Исключение
				ЗаписьЖурналаРегистрации(
					НСтр("ru = 'Очистка папок от старых писем'", ОбщегоНазначенияКлиентСервер.КодОсновногоЯзыка()),
					УровеньЖурналаРегистрации.Ошибка,,,
					ПодробноеПредставлениеОшибки(ИнформацияОбОшибке()));
			КонецПопытки;
				
		КонецЦикла;
			
	КонецЦикла;
	
	ЗаписьЖурналаРегистрации(
		НСтр("ru = 'Очистка папок от старых писем'", ОбщегоНазначенияКлиентСервер.КодОсновногоЯзыка()),
		УровеньЖурналаРегистрации.Информация,,,
		НСтр("ru = 'Завершение'", ОбщегоНазначенияКлиентСервер.КодОсновногоЯзыка()));
	
	Возврат БылиПисьмаДляУдаления;
	
КонецФункции
